In [ ]:
import pandas as pd

In [ ]:
import numpy as np

In [ ]:
s = pd.Series(4)
s

0    4
dtype: int64

In [ ]:
s_def = pd.Series(data=[21,34,54], index=['adam','tomek', 'pawel'], name='wiek')
s_def

adam     21
tomek    34
pawel    54
Name: wiek, dtype: int64

In [ ]:
A = np.random.randn(10)
s = pd.Series(A)
s

0    1.075610
1   -0.993556
2   -1.482775
3    0.443815
4   -0.951453
5   -0.756823
6    0.711712
7   -0.387509
8    0.683938
9    0.636211
dtype: float64

In [ ]:
stocks = {'Apple':'USA', 'CD Projekt': 'Poland', 'Amazon':'USA'}
series = pd.Series(stocks)
series

Apple            USA
CD Projekt    Poland
Amazon           USA
dtype: object

In [ ]:
stocks_price = {'Aplle': 196, 'CD Project': 215, 'Amazon': 1877}
stocks_price_series = pd.Series(stocks_price, name='price')
stocks_price_series

Aplle          196
CD Project     215
Amazon        1877
Name: price, dtype: int64

In [ ]:
stocks_price_array = stocks_price_series.values
stocks_price_array

array([ 196,  215, 1877])

In [ ]:
apple_price = stocks_price_series['Aplle']
apple_price

np.int64(196)

In [ ]:
'Aplle' in stocks_price_series

True

In [ ]:
np.random.seed(0)

A = np.random.rand(20)
s = pd.Series(A)
s

0     0.548814
1     0.715189
2     0.602763
3     0.544883
4     0.423655
5     0.645894
6     0.437587
7     0.891773
8     0.963663
9     0.383442
10    0.791725
11    0.528895
12    0.568045
13    0.925597
14    0.071036
15    0.087129
16    0.020218
17    0.832620
18    0.778157
19    0.870012
dtype: float64

In [ ]:
s[0]
s[1]
s[5:10]
s[:10]

0    0.548814
1    0.715189
2    0.602763
3    0.544883
4    0.423655
5    0.645894
6    0.437587
7    0.891773
8    0.963663
9    0.383442
dtype: float64